# Statistics

Descriptive--> central tendency

In [1]:
import numpy as np

In [2]:
a=np.array([14,15,16,18,45])

a

array([14, 15, 16, 18, 45])

In [3]:
np.mean(a)

21.6

In [4]:
b=([45,48,65,75,89,155])
np.mean(b)

79.5

In [5]:
c=([458,689,452,496,155,258])

np.mean(c)

418.0

155,258,452,458,496,689

In [6]:
c=([452,458])
np.mean(c)

455.0

In [7]:
c=([458,689,452,496,155,258])
c

[458, 689, 452, 496, 155, 258]

In [8]:
np.median(c)

455.0

In [9]:
d=np.array([12,45,10,8,78,16,48])

np.median(d)

16.0

In [10]:
np.mean(d)

31.0

In [13]:
np.min(d)

8

In [14]:
np.max(d)

78

In [15]:
range=d.max()-d.min()

In [16]:
range

70

In [17]:
t=np.array([12,18,10,9,78,45,52])
t

array([12, 18, 10,  9, 78, 45, 52])

In [18]:
e=np.max(t)
e

78

In [19]:
f=np.min(t)
f

9

In [20]:
e-f

69

In [21]:
np.var(t)

613.4285714285714

In [22]:
np.std(t)

24.767490212546193

In [23]:
r=np.array([78,45,98,45,48,85,20,50])
np.mean(r)

58.625

In [24]:
np.median(r)

49.0

In [25]:
np.var(r)

583.984375

In [27]:
o=np.std(r)

In [28]:
o

24.165768661476505

In [30]:
round(o,2)

24.17

In [31]:
import pandas as pd

In [34]:
df=pd.read_csv('https://raw.githubusercontent.com/dsrscientist/dataset1/master/Social_Network_Ads.csv')

In [36]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [42]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [43]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [45]:
df['Age'].mean()

37.655

In [47]:
df['EstimatedSalary'].mean()

69742.5

In [49]:
u=df['User ID'].mean()

In [50]:
u

15691539.7575

In [52]:
round(u,)

15691540

In [53]:
df

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [54]:
i=df['EstimatedSalary'].max()

In [55]:
i

150000

In [56]:
j=df['EstimatedSalary'].min()

In [57]:
j

15000

In [60]:
i-j

135000

In [62]:
df['EstimatedSalary'].median()

70000.0

In [63]:
df['Age'].median()

37.0

In [65]:
p=df['User ID'].median()

In [66]:
round(p)

15694342

In [67]:
df['EstimatedSalary'].mode()

0    72000
Name: EstimatedSalary, dtype: int64

In [68]:
df['Age'].mode()

0    35
Name: Age, dtype: int64

In [69]:
r=np.array([78,45,98,45,48,85,20,50])
r

array([78, 45, 98, 45, 48, 85, 20, 50])

In [70]:
np.percentile(r,30)

45.3

In [71]:
np.percentile(r,50)

49.0

In [72]:
np.percentile(r,80)

82.2

In [73]:
pd.read_csv('https://raw.githubusercontent.com/dsrscientist/dataset1/master/president_heights.csv')

    order                    name  height
0       1       George Washington     189
1       2              John Adams     170
2       3        Thomas Jefferson     189
3       4           James Madison     163
4       5            James Monroe     183
5       6       John Quincy Adams     171
6       7          Andrew Jackson     185
7       8        Martin Van Buren     168
8       9  William Henry Harrison     173
9      10              John Tyler     183
10     11           James K. Polk     173
11     12          Zachary Taylor     173
12     13        Millard Fillmore     175
13     14         Franklin Pierce     178
14     15          James Buchanan     183
15     16         Abraham Lincoln     193
16     17          Andrew Johnson     178
17     18        Ulysses S. Grant     173
18     19     Rutherford B. Hayes     174
19     20       James A. Garfield     183
20     21       Chester A. Arthur     183
21     23       Benjamin Harrison     168
22     25        William McKinley     170
23     26      Theodore Roosevelt     178
24     27     William Howard Taft     182
25     28          Woodrow Wilson     180
26     29       Warren G. Harding     183
27     30         Calvin Coolidge     178
28     31          Herbert Hoover     182
29     32   Franklin D. Roosevelt     188
30     33         Harry S. Truman     175
31     34    Dwight D. Eisenhower     179
32     35         John F. Kennedy     183
33     36       Lyndon B. Johnson     193
34     37           Richard Nixon     182
35     38             Gerald Ford     183
36     39            Jimmy Carter     177
37     40           Ronald Reagan     185
38     41       George H. W. Bush     188
39     42            Bill Clinton     188
40     43          George W. Bush     182
41     44            Barack Obama     185

In [75]:
heights=['height']

In [77]:
print("mean height",heights.mean())

AttributeError: 'list' object has no attribute 'mean'